In [23]:
import json
import requests
import pandas as pd

In [24]:
apikey = 'SoGltsYnmN6ufcvwcN1JzxDztfu15mcZ'

In [25]:
start = 2000
end = 2022

In [26]:
result = []

In [27]:
while start <= end:
    url = "https://api.apilayer.com/exchangerates_data/timeseries?start_date="+str(start)+"-01-01&end_date="+str(start)+"-12-31&base=USD&symbols=INR"
    
    payload = {}
    headers= {
      "apikey": apikey
    }
    
    response = requests.request("GET", url, headers=headers, data = payload)
    
    status_code = response.status_code
    result.append(response.json())
    start = start + 1

In [67]:
dates =[]
inr_rate = []
for r in result:
    x = r['rates']
    for key in x.keys():
        dates.append(key)
        rate = x[key]['INR']
        inr_rate.append(rate)

In [68]:
inr_dict = {'Date': dates, 'Rate': inr_rate}
usd_inr = pd.DataFrame(inr_dict)

In [69]:
usd_inr.head()

         Date       Rate
0  2000-01-01  43.494130
1  2000-01-02  43.494130
2  2000-01-03  43.532065
3  2000-01-04  43.532065
4  2000-01-05  43.532065

In [70]:
usd_inr.to_csv('usd_to_inr.csv', index=False)

# Check the data from RBI

In [33]:
rbi = pd.read_excel('Daily_Exchange_Rate_of_the_Indian_Rupee.xlsx', header=4, dtype='object')

C:\Users\shiva\anaconda3\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [34]:
rbi

,Unnamed: 0,Date,US Dollar,Pound Sterling,Euro,Japanese Yen
0,NaN,2022-06-27 00:00:00,78.289,96.0784,82.6706,57.95
1,NaN,2022-06-24 00:00:00,78.3308,96.1286,82.5633,58.12
2,NaN,2022-06-23 00:00:00,78.2662,95.8453,82.6872,57.63
3,NaN,2022-06-22 00:00:00,78.2115,95.6657,82.0981,57.34
4,NaN,2022-06-21 00:00:00,78.0861,95.6784,82.1289,57.8
...,...,...,...,...,...,...
5762,NaN,1998-08-28 00:00:00,42.5405,70.5965,-,29.8151
5763,NaN,1998-08-27 00:00:00,42.5297,69.7788,-,29.6191
5764,NaN,1998-08-25 00:00:00,42.5007,69.5749,-,29.4681
5765,NaN,NaN,NaN,NaN,NaN,NaN
5766,NaN,Notes : 1) The exchange rate for Japanese Yen...,NaN,NaN,NaN,NaN

In [35]:
rbi.drop('Unnamed: 0', axis = 1, inplace=True)

In [38]:
rbi.dropna(inplace=True)

In [41]:
rbi.drop(['Pound Sterling','Euro','Japanese Yen'], axis=1, inplace=True)

In [44]:
rbi['Date'] = pd.to_datetime(rbi['Date'])

In [48]:
rbi.rename({'US Dollar':'Rate'}, axis=1, inplace=True)

In [52]:
rbi['Rate'] = pd.to_numeric(rbi['Rate'], errors='coerce')

In [62]:
rbi = rbi[~rbi['Rate'].isna()]

In [64]:
rbi.to_csv('rbi_usd_to_inr.csv', index=False)